tests/dag.dot
digraph dag {
a -> b
a -> d
b -> tree
c -> d
d -> e
e -> cat
cat -> tree
tree -> house
tree -> yard
}
