tests/dag.mermaid
---
title: dag
---
flowchart LR
    a(a) --> b(b)
    a(a) --> d(d)
    b(b) --> tree(tree)
    c(c) --> d(d)
    d(d) --> e(e)
    e(e) --> cat(cat)
    cat(cat) --> tree(tree)
    tree(tree) --> house(house)
    tree(tree) --> yard(yard)
